In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.read_csv('final_data.csv')

In [4]:
data.head()

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Unnamed: 0.1.1.1,model,fuel,km_driven,city,resale_val_new
0,0,0,0,0,2009,3,"67,220",Ahmedabad,161000
1,1,1,1,1,2016,1,"80,257",Ahmedabad,510000
2,2,2,2,2,2008,2,"90,417",Ahmedabad,154000
3,3,3,3,3,2015,1,"74,684",Ahmedabad,409374
4,4,4,4,4,2015,1,"40,048",Ahmedabad,481000

In [5]:
km =[]
for i in data['km_driven']:
    i = str(i)
    i = i.replace(',','')
    km.append(i)
    
data['km_driven'] = pd.DataFrame(km)

In [6]:
data.head()

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Unnamed: 0.1.1.1,model,fuel,km_driven,city,resale_val_new
0,0,0,0,0,2009,3,67220,Ahmedabad,161000
1,1,1,1,1,2016,1,80257,Ahmedabad,510000
2,2,2,2,2,2008,2,90417,Ahmedabad,154000
3,3,3,3,3,2015,1,74684,Ahmedabad,409374
4,4,4,4,4,2015,1,40048,Ahmedabad,481000

In [7]:
data['city'] = data['city'].astype('category')

In [8]:
data['city'] = data['city'].cat.codes

In [9]:
data.head()

,Unnamed: 0,Unnamed: 0.1,Unnamed: 0.1.1,Unnamed: 0.1.1.1,model,fuel,km_driven,city,resale_val_new
0,0,0,0,0,2009,3,67220,0,161000
1,1,1,1,1,2016,1,80257,0,510000
2,2,2,2,2,2008,2,90417,0,154000
3,3,3,3,3,2015,1,74684,0,409374
4,4,4,4,4,2015,1,40048,0,481000

In [10]:
x = data[['model','fuel','km_driven','city']]
y = data['resale_val_new']

In [11]:
y.shape

(1973,)

In [12]:
from sklearn.model_selection import train_test_split
train_x,test_x,train_y,test_y = train_test_split(x,y, shuffle=True, random_state=53)

In [13]:
from sklearn.ensemble import GradientBoostingRegressor
from sklearn.model_selection import GridSearchCV

In [14]:
params = {'loss':('huber','ls','lad'), 'n_estimators': [100,200,500,1000], 'min_samples_split':[2,5,10], 'subsample':[0.1,0.5,0.8], 'learning_rate':[1,0.08,0.5,0.05,0.02]}

model = GradientBoostingRegressor()

clf = GridSearchCV(model,params)

clf.fit(train_x,train_y)

GridSearchCV(estimator=GradientBoostingRegressor(),
             param_grid={'learning_rate': [1, 0.08, 0.5, 0.05, 0.02],
                         'loss': ('huber', 'ls', 'lad'),
                         'min_samples_split': [2, 5, 10],
                         'n_estimators': [100, 200, 500, 1000],
                         'subsample': [0.1, 0.5, 0.8]})

In [15]:
clf.best_estimator_

GradientBoostingRegressor(learning_rate=0.02, loss='lad', min_samples_split=5,
                          n_estimators=1000, subsample=0.5)

In [16]:
ypred = clf.predict(test_x)

In [17]:
ypred[1:10]

array([296113.03535039, 243265.13589723, 226564.56919007, 245514.20287443,
       440204.10305806, 254446.70686013, 173102.16935377, 198227.14099691,
       204271.44245156])

In [18]:
test_y[1:10]

1894    350000
633     180000
224     275000
481     325000
1300    450000
264     275000
639     125000
1624    230000
463     350000
Name: resale_val_new, dtype: int64

In [19]:
from sklearn.metrics import mean_squared_error
import math 
x = mean_squared_error(ypred,test_y)
print(math.sqrt(x))

54774.02444643157

In [20]:
import pickle
pickle.dump(clf,open('gbr_car.sav','wb'))

In [21]:
t =[[2012,1,100000,0]]
clf.predict(t)

array([334738.79328146])